//1.Составьте программу, которая присваивает переменной d значение 7, а затем выводит на экран:
//во второй – квадрат этого значения, 
//в третьей – куб этого значения.

      // let d=7;
      // console.log(d);

      // let b=d**2;
      // console.log(b);

      // let c=b**3;
      // console.log(c);

//2.Составьте программу,
// которая принимает с клавиатуры целое число и, 
//если оно положительное, увеличивает его вдвое.

    //  let number=Number(prompt('Введите число'));
    //  if (number > 0){
    //      number1=number*2;
    //      console.log(number1);
    //  }

//3. Составьте программу, которая принимает с клавиатуры два целых числа и, 
//если первое больше второго, выводит на экран их сумму, если же наоборот – 
//выводит на экран их произведение. 
//В случае же, если числа одинаковы, программа выводит на экран сообщение "числа одинаковые".

     // let mob=Number(prompt('Введите число'));
     // let mob2=Number(prompt('Введите число'));

     // if (mob>mob2){
     //     let a=mob+mob2;
     //     console.log(a);
     // }
     // else if(mob<mob2){
     //     let b=mob*mob2;
     //     console.log(b);
     // }
     // else{
     //     console.log('Числа одинаковые');
     // }

//4. Составьте программу, которая принимает с клавиатуры целое число и 
//выводит на экран его квадрат – но только в том случае, если введенное число отрицательно.
//В противном случае – на экран выводится сообщение "ошибка".

      // let hih=Number(prompt('Vvedite chislo'));

      // if (hih<0){
      //     a=hih**2;
      //     console.log(a);
      // }
      // else if(hih => 0){
      // console.log('Error')
      // }

//5. Составьте программу, которая принимает с клавиатуры два числа: первое – 
//количество учеников в классе, второе – количество стульев в кабинете.
//Программа проверит соответствие между этими двумя значениями и выведет на экран соответствующую информацию.
//ввод: 24, 28 ⇒ вывод: стульев хватает; ввод: 24, 22 ⇒ вывод: стульев не хватает)

       //let hih=Number(prompt('Ученики'));
       //let hih2=Number(prompt('Стулья'));

       //if (hih <= hih2){
       //    console.log('Стульев хватает');
       //}
       //else if( hih>hih2){
       //    console.log('Стульев не хватает');
       //}

// 6. Составьте программу, которая выводит на экран все однозначные
// положительные числа в возрастающем порядке.
//Перед началом вывода на экран следует вывести "старт", 
//а после окончания вывода чисел – "финиш".
//вывод: старт, 1, ... 9, финиш)

      // console.log('START')

      // for (a=0; a <10; a++){
      //     console.log(a);
      // }
      // console.log('FINISH');

// 7. Составьте программу, которая выводит на экран все двузначные положительные числа, 
//делящиеся без остатка на 5 (начиная с наименьшего).

     //  for( a=10 ; a < 100; a++){
     //      if ( a%5==0){
     //          console.log(a);
     //      }
     //  }

//8. Написать цикл, который выводит те числа из массива, которые больше или равны 15.

      // let arr=[];

      // 
      // for(let num=15; num<100 ; num++){
      //     arr.push(num);
      // }

      // console.log(arr);

//9. Написать цикл, который выводит только нечетные числа.

     //  for(a=0; a<100; a++){
     //      if( a%2 !=0){
     //          console.log(a);
     //      }
     //  }

//10. Вывести только те значения массива, индекс которых кратен трем

      // let arr=[];

      // for( a=0 ; a<100; a++){
      //     arr.push(a);
      //     console.log(arr);

      // }  Тут я запуталась напишите пожалуйста решение.